jamesmunns/kinetis-rs/usb/usb_core/hal/fsl_usb_ehci_hal.h
/*
 * Copyright (c) 2013, Freescale Semiconductor, Inc.
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without modification,
 * are permitted provided that the following conditions are met:
 *
 * o Redistributions of source code must retain the above copyright notice, this list
 *   of conditions and the following disclaimer.
 *
 * o Redistributions in binary form must reproduce the above copyright notice, this
 *   list of conditions and the following disclaimer in the documentation and/or
 *   other materials provided with the distribution.
 *
 * o Neither the name of Freescale Semiconductor, Inc. nor the names of its
 *   contributors may be used to endorse or promote products derived from this
 *   software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" AND
 * ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
 * WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
 * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR
 * ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES
 * (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES;
 * LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON
 * ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
 * (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS
 * SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */

#ifndef __FSL_USB_HAL_H__
#define __FSL_USB_HAL_H__

#include "adapter.h"
#if (OS_ADAPTER_ACTIVE_OS == OS_ADAPTER_SDK)
#include <stdint.h>
#include <stdbool.h>
#include <assert.h>
#include "fsl_usb_features.h"
#include "fsl_device_registers.h"
#define NEW_USB_HAL_ENABLE  1
#elif (OS_ADAPTER_ACTIVE_OS == OS_ADAPTER_BM)
    #if (defined(CPU_MK22F51212))
    #include "MK22F51212.h"
    #include "MK22F51212_usb.h"
    #define NEW_USB_HAL_ENABLE  1
#elif (defined(CPU_MK65F18))
    #include "MK65F18.h"
    #define NEW_USB_HAL_ENABLE  0
#elif (defined(CPU_MK70F12))
    #include "MK70F12.h"
    #define NEW_USB_HAL_ENABLE  0
    #endif
#elif (OS_ADAPTER_ACTIVE_OS == OS_ADAPTER_MQX)
#if (defined(CPU_MK22F51212))
#include "MK22F12.h"
#include "MK22F51212_usb.h"
#define NEW_USB_HAL_ENABLE	1
#elif (defined(CPU_MK70F12))
#include "MK70F12.h"
#define NEW_USB_HAL_ENABLE	0
#elif (defined(CPU_VF65GS10_A5))
#include "MVF50GS10MK50.h"
#define NEW_USB_HAL_ENABLE	0
#endif
#endif

#if NEW_USB_HAL_ENABLE


#else
//#include <stdint.h>
//#include <stdbool.h>
#include <assert.h>

#if (defined(CPU_MK70F12))
#include "MK70F12.h"
#elif (defined(CPU_MK65F18))
#include "MK65F18.h"
#endif
//#include "fsl_usb_features.h"
//#include "device/fsl_device_registers.h"

//! @addtogroup usb_hal
//! @{

//! @file

////////////////////////////////////////////////////////////////////////////////
// Definitions
////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////
// API
////////////////////////////////////////////////////////////////////////////////
 
#if defined(__cplusplus)
extern "C" {
#endif
#define HW_USB_INSTANCE_COUNT (1U)

#if (defined(CPU_VF65GS10_A5))
static USB_MemMapPtr _usb_hal_ehci_get_base_addr(uint32_t instance)
{
    USB_MemMapPtr base;	
	switch(instance)
	{
		case 0:
		    base = USB0_BASE_PTR;
		    break;
		case 1:
			base = USB1_BASE_PTR;
			break;
		default:
			break;
	}
	return base;
}
#endif

#if (defined(CPU_MK70F12)) || (defined(CPU_MK65F18))
static void usb_hal_ehci_set_controller_host_mode(uint32_t instance)
{
	USBHS_USBMODE = (USBHS_USBMODE & ~USBHS_USBMODE_CM_MASK) | USBHS_USBMODE_CM(0x3); 
}

static void usb_hal_ehci_set_controller_device_mode(uint32_t instance)
{
	USBHS_USBMODE = (USBHS_USBMODE & ~USBHS_USBMODE_CM_MASK) | USBHS_USBMODE_CM(0x2); 
}

static void usb_hal_ehci_set_big_endian(uint32_t instance)
{
	USBHS_USBMODE = (USBHS_USBMODE & ~USBHS_USBMODE_ES_MASK)|(1 << USBHS_USBMODE_ES_SHIFT);
}

static void usb_hal_ehci_set_little_endian(uint32_t instance)
{
	USBHS_USBMODE = (USBHS_USBMODE & ~USBHS_USBMODE_ES_MASK)|(0 << USBHS_USBMODE_ES_SHIFT);
}

static void usb_hal_ehci_disable_setup_lock(uint32_t instance)
{
	USBHS_USBMODE = (USBHS_USBMODE & ~USBHS_USBMODE_SLOM_MASK)|(1 << USBHS_USBMODE_SLOM_SHIFT);
}

static void usb_hal_ehci_enable_setup_lock(uint32_t instance)
{
	USBHS_USBMODE = (USBHS_USBMODE & ~USBHS_USBMODE_SLOM_MASK)|(0 << USBHS_USBMODE_SLOM_SHIFT);
}

static void usb_hal_ehci_set_usb_mode(uint32_t instance, uint32_t mode)
{
   USBHS_USBMODE = mode;
}

static uint32_t usb_hal_ehci_get_dcc_params(uint32_t instance)
{
	return USBHS_DCCPARAMS;
}

static void usb_hal_ehci_clear_ep_setup_status(uint32_t instance, uint32_t epSetupStatus)
{	
	USBHS_EPSETUPSR |= (epSetupStatus << USBHS_EPSETUPSR_EPSETUPSTAT_SHIFT) & USBHS_EPSETUPSR_EPSETUPSTAT_MASK;
}

static void usb_hal_ehci_clear_setup_stat_ep_num(uint32_t instance, uint32_t ep_num)
{
    USBHS_EPSETUPSR = ep_num;
}

static uint32_t usb_hal_ehci_get_ep_setup_status(uint32_t instance)
{	
	return USBHS_EPSETUPSR;
}

static uint32_t usb_hal_ehci_get_ep_complete_status(uint32_t instance)
{
	return USBHS_EPCOMPLETE;
}

static void usb_hal_ehci_clear_ep_complete_status(uint32_t instance, uint32_t epCompleteStatus)
{
	USBHS_EPCOMPLETE = epCompleteStatus;
}

static void usb_hal_ehci_set_eplist_address(uint32_t instance, uint32_t epQHAddress)
{
	USBHS_EPLISTADDR = epQHAddress;
}

static uint32_t usb_hal_ehci_get_eplist_address(uint32_t instance)
{
	return USBHS_EPLISTADDR;
}

static uint32_t usb_hal_ehci_get_interrupt_status(uint32_t instance)
{
    return USBHS_USBINTR;
}


