jamesmunns/kinetis-rs/usb/usb_core/hal/fsl_usb_ehci_hal.h
static void usb_hal_ehci_enable_interrupts(uint32_t instance, uint32_t intrType)
{
	USBHS_USBINTR |= intrType;
}

static void usb_hal_ehci_interrupts_set(uint32_t instance, uint32_t intrType)
{
   USBHS_USBINTR = intrType;
}

static void usb_hal_ehci_disable_interrupts(uint32_t instance, uint32_t intrType)
{
	USBHS_USBINTR &= ~intrType;
}

static void usb_hal_ehci_enable_pull_up(uint32_t instance)
{
	USBHS_USBCMD = EHCI_CMD_RUN_STOP;
}

static void usb_hal_ehci_initiate_attach_event(uint32_t instance)
{
	USBHS_USBCMD |= EHCI_CMD_RUN_STOP;
}

static void usb_hal_ehci_initiate_detach_event(uint32_t instance)
{
	USBHS_USBCMD &= ~EHCI_CMD_RUN_STOP;
}

static void usb_hal_ehci_reset_controller(uint32_t instance)
{
	USBHS_USBCMD = EHCI_CMD_CTRL_RESET;
}

static void usb_hal_ehci_set_dtd_tripwire(uint32_t instance)
{
	USBHS_USBCMD |= EHCI_CMD_ATDTW_TRIPWIRE_SET;
}

static void usb_hal_ehci_clear_dtd_tripwire(uint32_t instance)
{
	USBHS_USBCMD &= ~EHCI_CMD_ATDTW_TRIPWIRE_SET;
}

static void usb_hal_echi_clear_usb_cmd_async_sched_enable(uint32_t instance)
{
    USBHS_USBCMD &= ~EHCI_USBCMD_ASYNC_SCHED_ENABLE;
}

static void usb_hal_ehci_set_usb_cmd_async_sched_enable(uint32_t instance)
{
    USBHS_USBCMD |= EHCI_USBCMD_ASYNC_SCHED_ENABLE;
}
static void usb_hal_ehci_clear_usb_cmd_periodic_sched_enable(uint32_t instance)
{
    USBHS_USBCMD &= ~EHCI_USBCMD_PERIODIC_SCHED_ENABLE;
}

static uint32_t usb_hal_ehci_is_tripwire_set(uint32_t instance)
{
	return (USBHS_USBCMD & EHCI_CMD_ATDTW_TRIPWIRE_SET);
}


static void usb_hal_ehci_clear_usb_cmd_setup_trip_wire(uint32_t instance)
{
    USBHS_USBCMD &= ~EHCI_CMD_SETUP_TRIPWIRE_SET;
}

static void usb_hal_ehci_set_usb_cmd_setup_trip_wire(uint32_t instance)
{
    USBHS_USBCMD |= EHCI_CMD_SETUP_TRIPWIRE_SET;
}


static void usb_hal_ehci_set_usb_cmd(uint32_t instance, uint32_t value)
{
    USBHS_USBCMD = value;
}

static uint32_t  usb_hal_ehci_get_usb_cmd(uint32_t instance)
{
	return USBHS_USBCMD;
}



static uint8_t usb_hal_ehci_get_cap_length(uint32_t instance)
{
    return USBHS_CAPLENGTH;
}

static void usb_hal_ehci_set_usb_config(uint32_t instance, uint32_t value)
{
    //USBHS_CONFIGFLAG = value;
}


static void usb_hal_ehci_set_endpoint_prime(uint32_t instance, uint32_t value)
{	
	USBHS_EPPRIME = value;
}

static uint32_t usb_hal_ehci_get_endpoint_prime(uint32_t instance)
{
	return USBHS_EPPRIME;
}
static uint32_t usb_hal_echi_get_endpoint_status(uint32_t instance)
{
	return USBHS_EPSR;
}

static void usb_hal_ehci_flush_endpoint_buffer(uint32_t instance, uint32_t epNumber)
{
	USBHS_EPFLUSH = epNumber;
}

static uint32_t usb_hal_ehci_is_endpoint_transfer_flushed(uint32_t instance, uint32_t epNumber)
{
	return (USBHS_EPFLUSH & epNumber);
}

static uint32_t usb_hal_ehci_get_frame_index(uint32_t instance)
{
	return USBHS_FRINDEX;
}

static uint32_t usb_hal_ehci_get_port_status(uint32_t instance)
{
	return USBHS_PORTSC1;
}

static void usb_hal_ehci_set_port_status(uint32_t instance, uint32_t status)
{
	USBHS_PORTSC1 = status;
}

static uint32_t usb_hal_ehci_get_usb_status(uint32_t instance)
{
	return USBHS_USBSTS;
}

static void usb_hal_ehci_clear_usb_status(uint32_t instance, uint32_t status)
{
	USBHS_USBSTS = status;
}

static uint32_t usb_hal_ehci_get_hcsparams(uint32_t instance)
{
	return USBHS_HCSPARAMS;
}

static void usb_hal_ehci_clear_device_address(uint32_t instance)
{
	USBHS_DEVICEADDR &= ~0xFE000000;
}

static void usb_hal_ehci_set_qh_to_curr_async_list(uint32_t instance, uint32_t qh_addr)
{
    USBHS_ASYNCLISTADDR = qh_addr;
}

static uint32_t usb_hal_ehci_get_curr_async_list(uint32_t instance)
{
   return USBHS_ASYNCLISTADDR;
}

static void usb_hal_ehci_set_periodic_list_base_addr(uint32_t instance, uint32_t base_addr)
{
    USBHS_PERIODICLISTBASE = base_addr;
}
static void usb_hal_ehci_enable_endpoint(uint32_t instance, uint32_t epNumber, uint32_t direction, uint32_t type)
{
	if (epNumber == 0)
		USBHS_EPCR0 |= ((direction ? (EHCI_EPCTRL_TX_ENABLE |
            EHCI_EPCTRL_TX_DATA_TOGGLE_RST) :
            (EHCI_EPCTRL_RX_ENABLE | EHCI_EPCTRL_RX_DATA_TOGGLE_RST)) |
            (type << (direction ?
            EHCI_EPCTRL_TX_EP_TYPE_SHIFT : EHCI_EPCTRL_RX_EP_TYPE_SHIFT)));
	else
		USBHS_EPCR_REG(USBHS_BASE_PTR,epNumber - 1) |= ((direction ? (EHCI_EPCTRL_TX_ENABLE |
            EHCI_EPCTRL_TX_DATA_TOGGLE_RST) :
            (EHCI_EPCTRL_RX_ENABLE | EHCI_EPCTRL_RX_DATA_TOGGLE_RST)) |
            (type << (direction ?
            EHCI_EPCTRL_TX_EP_TYPE_SHIFT : EHCI_EPCTRL_RX_EP_TYPE_SHIFT)));
}

static void usb_hal_ehci_disable_endpoint(uint32_t instance, uint32_t epNumber, uint32_t direction)
{
    USBHS_EPCR(epNumber) &= ~(direction ? (EHCI_EPCTRL_TX_ENABLE|EHCI_EPCTRL_TX_TYPE):(EHCI_EPCTRL_RX_ENABLE|EHCI_EPCTRL_RX_TYPE));
}

static uint32_t usb_hal_ehci_get_endpoint_control(uint32_t instance, uint32_t epNumber)
{
	return (epNumber == 0 ? USBHS_EPCR0 : USBHS_EPCR_REG(USBHS_BASE_PTR,epNumber - 1));
}	


static void usb_hal_ehci_clear_endpoint_stall(uint32_t instance, uint32_t epNumber, uint32_t direction)
{
	if (epNumber == 0)
		USBHS_EPCR0 &= ~(direction ? EHCI_EPCTRL_TX_EP_STALL : EHCI_EPCTRL_RX_EP_STALL);
	else
		USBHS_EPCR_REG(USBHS_BASE_PTR,epNumber - 1) &= ~(direction ? EHCI_EPCTRL_TX_EP_STALL : EHCI_EPCTRL_RX_EP_STALL);
}

static void usb_hal_ehci_stall_both_directions(uint32_t instance, uint32_t epNumber)
{
	if (epNumber == 0)
		USBHS_EPCR0 |= (EHCI_EPCTRL_TX_EP_STALL | EHCI_EPCTRL_RX_EP_STALL);
	else
		USBHS_EPCR_REG(USBHS_BASE_PTR,epNumber - 1) |= (EHCI_EPCTRL_TX_EP_STALL | EHCI_EPCTRL_RX_EP_STALL);
}

static void usb_hal_ehci_stall_specific_direction(uint32_t instance, uint32_t epNumber, uint32_t direction)
{
	if (epNumber == 0)
		USBHS_EPCR0 |= (direction ? EHCI_EPCTRL_TX_EP_STALL : EHCI_EPCTRL_RX_EP_STALL);
	else
		USBHS_EPCR_REG(USBHS_BASE_PTR,epNumber - 1) |= (direction ? EHCI_EPCTRL_TX_EP_STALL : EHCI_EPCTRL_RX_EP_STALL);
		
