jamesmunns/kinetis-rs/usb/usb_core/hal/fsl_usb_ehci_hal.h
}



static void usb_hal_ehci_set_device_address(uint32_t instance, uint32_t address)
{
	USBHS_DEVICEADDR = (uint32_t)(address << USBHS_ADDRESS_BIT_SHIFT);
}

static void usb_hal_ehci_clear_max_packet_length(uint32_t instance,usb_ehc_dev_qh_struct_t * epQueueHeadAddr)
{
	epQueueHeadAddr->MAX_PKT_LENGTH = 0;
}

static void usb_hal_ehci_set_max_packet_length(uint32_t instance,usb_ehc_dev_qh_struct_t * epQueueHeadAddr, uint32_t maxPacketSize)
{
	epQueueHeadAddr->MAX_PKT_LENGTH = ((uint32_t)maxPacketSize) ;
}

static void usb_hal_ehci_set_max_packet_length_for_non_iso(uint32_t instance,usb_ehc_dev_qh_struct_t * epQueueHeadAddr, uint32_t value)
{
    epQueueHeadAddr->MAX_PKT_LENGTH = value;
}

static uint32_t usb_hal_ehci_is_ios_set(uint32_t instance, usb_ehc_dev_qh_struct_t * epQueueHeadAddr)
{
	return (epQueueHeadAddr->MAX_PKT_LENGTH & VUSB_EP_QUEUE_HEAD_IOS);
}

static void usb_hal_ehci_set_next_dtd_terminate(uint32_t instance,usb_ehc_dev_qh_struct_t * epQueueHeadAddr)
{
	epQueueHeadAddr->NEXT_DTD_PTR = VUSB_EP_QUEUE_HEAD_NEXT_TERMINATE;
}

static void usb_hal_ehci_set_dtd_next_tr_elem_terminate(uint32_t instance, usb_ehci_dev_dtd_struct_t * dTD_ptr)
{
   dTD_ptr->NEXT_TR_ELEM_PTR = VUSB_EP_QUEUE_HEAD_NEXT_TERMINATE;
}

static void usb_hal_ehci_set_dtd_next_tr_elem_ptr(uint32_t instance, usb_ehci_dev_dtd_struct_t * temp_dTD_ptr, uint32_t dTD_ptr)
{
   temp_dTD_ptr->NEXT_TR_ELEM_PTR = dTD_ptr;
}

static void usb_hal_ehci_set_qh_next_dtd(uint32_t instance,usb_ehc_dev_qh_struct_t * epQueueHeadAddr, uint32_t dtdAddr)
{
	epQueueHeadAddr->NEXT_DTD_PTR = dtdAddr;
}

static void usb_hal_ehci_set_next_dtd_invalid(uint32_t instance, usb_ehci_dev_dtd_struct_t * dtdAddr)
{
	dtdAddr->NEXT_TR_ELEM_PTR = USBHS_TD_NEXT_TERMINATE;
}

static void usb_hal_ehci_clear_size_ioc_sts(uint32_t instance, usb_ehci_dev_dtd_struct_t * dtdAddr)
{
	dtdAddr->SIZE_IOC_STS = 0;
}

static void usb_hal_ehci_clear_ioc_reserved_fields(uint32_t instance, usb_ehci_dev_dtd_struct_t * dtdAddr)
{
	dtdAddr->SIZE_IOC_STS &= ~USBHS_TD_RESERVED_FIELDS;
}

static void usb_hal_ehci_clear_dtd(uint32_t instance, usb_ehci_dev_dtd_struct_t * dtdAddr)
{
	dtdAddr->NEXT_TR_ELEM_PTR = 0;
	dtdAddr->SIZE_IOC_STS = 0;
	dtdAddr->BUFF_PTR0 = 0;
	dtdAddr->BUFF_PTR1 = 0;
	dtdAddr->BUFF_PTR2 = 0;
	dtdAddr->BUFF_PTR3 = 0;
	dtdAddr->BUFF_PTR4 = 0;
}

static void usb_hal_ehci_set_dtd_buffer_address(uint32_t instance, usb_ehci_dev_dtd_struct_t * dtdAddr, uint32_t addr)
{
	dtdAddr->BUFF_PTR0 = addr;
	dtdAddr->BUFF_PTR1 = addr + 4096;
	dtdAddr->BUFF_PTR2 = addr + (4096*2);
	dtdAddr->BUFF_PTR3 = addr + (4096*3);
	dtdAddr->BUFF_PTR4 = addr + (4096*4);
}

static void usb_hal_ehci_set_dtd_size_ioc_status(uint32_t instance, usb_ehci_dev_dtd_struct_t * dtdAddr, uint32_t value)
{
	dtdAddr->SIZE_IOC_STS = value;
}

static uint32_t usb_hal_ehci_get_dtd_size_ioc_status(uint32_t instance, usb_ehci_dev_dtd_struct_t * dtdAddr)
{
	return dtdAddr->SIZE_IOC_STS;
}


static uint32_t usb_hal_ehci_get_next_dtd_address(uint32_t instance, usb_ehci_dev_dtd_struct_t * dtdAddr)
{
	return (dtdAddr->NEXT_TR_ELEM_PTR & USBHS_TD_ADDR_MASK);
}

static uint32_t usb_hal_ehci_get_dtd_error_status(uint32_t instance, usb_ehci_dev_dtd_struct_t * dtdAddr)
{
	return (dtdAddr->SIZE_IOC_STS & USBHS_TD_ERROR_MASK);
}



static void usb_hal_ehci_clear_qh_error_status(uint32_t instance, usb_ehc_dev_qh_struct_t * epQueueHeadAddr, uint32_t errors)
{
	epQueueHeadAddr->SIZE_IOC_INT_STS &= ~errors;
}

static uint32_t usb_hal_ehci_get_tr_packet_size(uint32_t instance,usb_ehci_dev_dtd_struct_t * dtdAddr)
{
	return ((dtdAddr->SIZE_IOC_STS & VUSB_EP_TR_PACKET_SIZE) >> 16);
}

static uint32_t usb_hal_ehci_get_xd_for_this_dtd(uint32_t instance, usb_ehci_dev_dtd_struct_t * dtdAddr)
{
	return (uint32_t)dtdAddr->xd_for_this_dtd;
}


static void usb_hal_ehci_clear_size_ioc_int_sts(uint32_t instance, usb_ehc_dev_qh_struct_t * epQueueHeadAddr)
{
	epQueueHeadAddr->SIZE_IOC_INT_STS = 0;
}



static uint32_t usb_hal_ehci_get_fstn_normal_path_link_ptr(uint32_t instance,ehci_fstn_struct_t* FSTN_ptr)
{
   return FSTN_ptr->normal_path_link_ptr;
}

static void  usb_hal_ehci_set_fstn_normal_path_link_ptr(uint32_t instance,ehci_fstn_struct_t* FSTN_ptr, uint32_t next)
{
   FSTN_ptr->normal_path_link_ptr = next;
}


static void usb_hal_ehci_add_frame_list_pointer_itd(uint32_t instance, uint32_t *transaction_descriptor, ehci_itd_struct_t* itd_ptr)
{
   *transaction_descriptor = (uint32_t) itd_ptr | (EHCI_FRAME_LIST_ELEMENT_TYPE_ITD << EHCI_FRAME_LIST_ELEMENT_TYPE_BIT_POS);
}

static void usb_hal_ehci_add_frame_list_pointer_sitd(uint32_t instance, uint32_t *transaction_descriptor, ehci_sitd_struct_t* sitd_ptr)
{
   *transaction_descriptor = (uint32_t) sitd_ptr | (EHCI_FRAME_LIST_ELEMENT_TYPE_SITD << EHCI_FRAME_LIST_ELEMENT_TYPE_BIT_POS);
}


static uint32_t usb_hal_ehci_get_periodic_list_addr(uint32_t instance, volatile uint32_t*  transfer_data_struct_ptr)
{
   return (*transfer_data_struct_ptr);
}

static void usb_hal_ehci_set_periodic_list_addr(uint32_t instance, volatile uint32_t*  transfer_data_struct_ptr, ehci_qh_struct_t* qh_ptr)
{
   *transfer_data_struct_ptr = ((uint32_t)qh_ptr | (EHCI_FRAME_LIST_ELEMENT_TYPE_QH << EHCI_QH_ELEMENT_TYPE_BIT_POS));
}


static void usb_hal_ehci_set_transfer_data_struct(uint32_t instance, volatile uint32_t*  transfer_data_struct_ptr, uint32_t temp_transfer_struct_ptr)
{
  *transfer_data_struct_ptr = temp_transfer_struct_ptr;
}

//static void usb_hal_ehci_store_device_address(uint32_t instance, ehci_itd_struct_t* itd_ptr)
//{
//   itd_ptr->buffer_page_ptr_list[0] |= (uint32_t)(pipe_descr_ptr->G.DEVICE_ADDRESS);
//}

static void usb_hal_ehci_set_itd_next_link_pointer(uint32_t instance,ehci_itd_struct_t* itd_ptr, uint32_t transaction_descriptor )
{
    itd_ptr->next_link_ptr = (uint32_t)transaction_descriptor;
}

static uint32_t usb_hal_ehci_get_itd_next_link_pointer(uint32_t instance,ehci_itd_struct_t* itd_ptr)
{
   return itd_ptr->next_link_ptr;
}


static void usb_hal_ehci_set_ITD_terminate_bit(uint32_t instance,ehci_itd_struct_t* itd_ptr)
{
   itd_ptr->next_link_ptr = EHCI_ITD_T_BIT;
}


