jamesmunns/kinetis-rs/usb/usb_core/hal/fsl_usb_ehci_hal.h
static void usb_hal_ehci_store_endpoint_number_and_device_addr(uint32_t instance, ehci_itd_struct_t* itd_ptr, uint32_t value)
{
    itd_ptr->buffer_page_ptr_list[0] = value;
}

static void usb_hal_ehci_store_max_packet_size_and_direction(uint32_t instance, ehci_itd_struct_t* itd_ptr, uint32_t value)
{
		itd_ptr->buffer_page_ptr_list[1] = value;
}

static void usb_hal_ehci_store_direction(uint32_t instance, ehci_itd_struct_t* itd_ptr, uint32_t direction)
{
    itd_ptr->buffer_page_ptr_list[1] |= (uint32_t)(direction << EHCI_ITD_DIRECTION_BIT_POS);
}

static void usb_hal_ehci_set_transaction_number_per_micro_frame(uint32_t instance, ehci_itd_struct_t* itd_ptr, uint32_t number)
{
   itd_ptr->buffer_page_ptr_list[2] = number;
}

static void usb_hal_ehci_set_buffer_page_pointer(uint32_t instance, ehci_itd_struct_t* itd_ptr, uint32_t page_number, uint32_t buffer_ptr)
{
   itd_ptr->buffer_page_ptr_list[page_number] = buffer_ptr;
}

static uint32_t usb_hal_ehci_get_buffer_page_pointer(uint32_t instance, ehci_itd_struct_t* itd_ptr, uint32_t page_number)
{
   return itd_ptr->buffer_page_ptr_list[page_number];
}


static void usb_hal_ehci_set_transcation_status_and_control_bit(uint32_t instance, ehci_itd_struct_t* itd_ptr, uint32_t number, uint32_t value)
{
  itd_ptr->tr_status_ctl_list[number] = value;
}

static void usb_hal_ehci_set_transcation_status_active_bit(uint32_t instance, ehci_itd_struct_t* itd_ptr, uint32_t number)
{
   itd_ptr->tr_status_ctl_list[number] = itd_ptr->tr_status_ctl_list[number] | EHCI_ITD_ACTIVE_BIT;
}

static uint32_t usb_hal_ehci_get_transcation_status_ctl_list(uint32_t instance, ehci_itd_struct_t* itd_ptr, uint32_t transaction_number)
{
   return itd_ptr->tr_status_ctl_list[transaction_number];
}


static void usb_hal_ehci_set_itd_length_scheduled(uint32_t instance, ehci_itd_struct_t* itd_ptr, uint32_t length_scheduled)
{
  itd_ptr->reserved[MEM_SIZE_INDEX] = length_scheduled;
}



static void usb_hal_ehci_set_sitd_next_link_pointer(uint32_t instance,ehci_sitd_struct_t* sitd_ptr, uint32_t transaction_descriptor )
{
    sitd_ptr->next_link_ptr =  (uint32_t)transaction_descriptor;
}

static uint32_t usb_hal_ehci_get_sitd_next_link_pointer(uint32_t instance,ehci_sitd_struct_t* sitd_ptr)
{
   return sitd_ptr->next_link_ptr;
}

static uint32_t usb_hal_ehci_get_sitd_transfer_state(uint32_t instance,ehci_sitd_struct_t* sitd_ptr)
{
    return sitd_ptr->transfer_state;
}


static void usb_hal_ehci_set_sitd_next_link_terminate_bit(uint32_t instance, ehci_sitd_struct_t* sitd_ptr)
{
	sitd_ptr->next_link_ptr = EHCI_SITD_T_BIT;
}

static void usb_hal_ehci_set_sitd_back_pointer_terminate_bit(uint32_t instance, ehci_sitd_struct_t* sitd_ptr)
{
    sitd_ptr->back_link_ptr = EHCI_SITD_T_BIT;
}

static void usb_hal_ehci_set_sitd_ep_capab_charac(uint32_t instance, ehci_sitd_struct_t* sitd_ptr, uint32_t value)
{
   sitd_ptr->ep_capab_charac = value;
}

static void usb_hal_ehci_set_sitd_uframe_sched_ctl(uint32_t instance, ehci_sitd_struct_t* sitd_ptr, uint32_t value)
{
   sitd_ptr->uframe_sched_ctl= value;
}

static void usb_hal_ehci_set_sitd_transfer_state(uint32_t instance, ehci_sitd_struct_t* sitd_ptr, uint32_t value)
{
   sitd_ptr->transfer_state = value;
}

static void usb_hal_ehci_set_sitd_length_scheduled(uint32_t instance, ehci_sitd_struct_t* sitd_ptr, uint32_t length_scheduled)
{
   sitd_ptr->reserved[MEM_SIZE_INDEX] = length_scheduled;
}

static uint32_t usb_hal_ehci_get_sitd_length_scheduled(uint32_t instance, ehci_sitd_struct_t* sitd_ptr)
{
  return sitd_ptr->reserved[MEM_SIZE_INDEX];
}


static uint32_t usb_hal_ehci_get_sitd_buffer_ptr_0(uint32_t instance, ehci_sitd_struct_t* sitd_ptr)
{
  return sitd_ptr->buffer_ptr_0;
}

static void usb_hal_ehci_set_sitd_buffer_ptr_0(uint32_t instance, ehci_sitd_struct_t* sitd_ptr, uint32_t buffer_ptr)
{
   sitd_ptr->buffer_ptr_0 = buffer_ptr;
}

static void usb_hal_ehci_set_sitd_buffer_ptr_1(uint32_t instance, ehci_sitd_struct_t* sitd_ptr, uint32_t buffer_ptr)
{
   sitd_ptr->buffer_ptr_1 = buffer_ptr;
}

static void usb_hal_ehci_set_qh_next_alt_qtd_link_terminate(uint32_t instance, ehci_qh_struct_t* qh_ptr)
{
   qh_ptr->alt_next_qtd_link_ptr = EHCI_QTD_T_BIT;
}

static void usb_hal_ehci_set_qh_next_qtd_link_ptr(uint32_t instance, ehci_qh_struct_t* qh_ptr, uint32_t first_qtd_ptr)
{

   qh_ptr->next_qtd_link_ptr = (uint32_t)first_qtd_ptr;
}

static void usb_hal_ehci_set_qh_next_qtd_link_terminate(uint32_t instance, ehci_qh_struct_t* qh_ptr)

{
   qh_ptr->next_qtd_link_ptr = EHCI_QTD_T_BIT;
}
static uint32_t usb_hal_ehci_get_next_qtd_link_ptr(uint32_t instance, ehci_qh_struct_t* qh_ptr)
{
  return (uint32_t)qh_ptr->next_qtd_link_ptr;
}



static void usb_hal_ehci_clear_qh_status(uint32_t instance, ehci_qh_struct_t* qh_ptr)
{
  qh_ptr->status = 0;
}

static uint32_t usb_hal_ehci_get_qh_status(uint32_t instance, ehci_qh_struct_t* qh_ptr)
{
   return qh_ptr->status;
}

static void usb_hal_ehci_set_qh_status(uint32_t instance, ehci_qh_struct_t* qh_ptr, uint32_t status)
{
   qh_ptr->status = status;
}

static uint32_t usb_hal_ehci_get_qh_horiz_link_ptr(uint32_t instance, ehci_qh_struct_t* qh_ptr)
{
  return qh_ptr->horiz_link_ptr;
}

static void usb_hal_ehci_set_qh_horiz_link_ptr(uint32_t instance, ehci_qh_struct_t* qh_ptr, uint32_t link_ptr)
{

   qh_ptr->horiz_link_ptr = link_ptr;
}

static void usb_hal_ehci_init_qh(uint32_t instance,  ehci_qh_struct_t* qh_ptr)
{
    qh_ptr->curr_qtd_link_ptr = EHCI_QTD_T_BIT;
    qh_ptr->alt_next_qtd_link_ptr = EHCI_QTD_T_BIT;
    qh_ptr->status = 0;
	qh_ptr->buffer_ptr_0 = 0;
	qh_ptr->buffer_ptr_1 = 0;
	qh_ptr->buffer_ptr_2 = 0;
    qh_ptr->buffer_ptr_3 = 0;
	qh_ptr->buffer_ptr_4 = 0;
}


static void usb_hal_ehci_set_ep_capab_charac1(uint32_t instance,  ehci_qh_struct_t* qh_ptr, uint32_t temp_ep_capab)
{
   qh_ptr->ep_capab_charac1 = temp_ep_capab;
}

static uint32_t usb_hal_ehci_get_ep_capab_charac1(uint32_t instance,  ehci_qh_struct_t* qh_ptr)
{
   return qh_ptr->ep_capab_charac1;
}

static void usb_hal_ehci_set_ep_capab_charac2(uint32_t instance,  ehci_qh_struct_t* qh_ptr, uint32_t temp_ep_capab)
{
   qh_ptr->ep_capab_charac2 = temp_ep_capab;
}

static uint32_t usb_hal_ehci_get_ep_capab_charac2(uint32_t instance,  ehci_qh_struct_t* qh_ptr)
{
   return qh_ptr->ep_capab_charac2;
}

static void usb_hal_ehci_set_qh_horiz_link_ptr_head_pointer_terminate(uint32_t instance,  ehci_qh_struct_t* qh_ptr)
{
   qh_ptr->horiz_link_ptr = EHCI_QUEUE_HEAD_POINTER_T_BIT;
}


static void usb_hal_ehci_set_qtd_buffer_page_pointer(uint32_t instance, ehci_qtd_struct_t* qtd_ptr, uint32_t buffer_start_address)
{
   qtd_ptr->buffer_ptr_0 = buffer_start_address;
   qtd_ptr->buffer_ptr_1 = qtd_ptr->buffer_ptr_0 + 4096;
   qtd_ptr->buffer_ptr_2 = qtd_ptr->buffer_ptr_1 + 4096;
   qtd_ptr->buffer_ptr_3 = qtd_ptr->buffer_ptr_2 + 4096;
   qtd_ptr->buffer_ptr_4 = qtd_ptr->buffer_ptr_3 + 4096;
}


static void usb_hal_ehci_set_qtd_token(uint32_t instance, ehci_qtd_struct_t* qtd_ptr, uint32_t token)
{

   qtd_ptr->token = token;
}

static void usb_hal_ehci_clear_qtd_token_bits(uint32_t instance, ehci_qtd_struct_t* qtd_ptr, uint32_t token_bits)
{
   qtd_ptr->token &= ~token_bits;
}

static uint32_t usb_hal_ehci_get_qtd_token(uint32_t instance, ehci_qtd_struct_t* qtd_ptr)
{

