jamesmunns/kinetis-rs/usb/usb_core/hal/fsl_usb_ehci_hal.h
   return qtd_ptr->token;
}

static void usb_hal_ehci_set_qtd_terminate_bit(uint32_t instance, ehci_qtd_struct_t* qtd_ptr)
{
	qtd_ptr->next_qtd_ptr = EHCI_QTD_T_BIT;
}

static uint32_t usb_hal_ehci_get_next_qtd_ptr(uint32_t instance,ehci_qtd_struct_t* qtd_ptr)
{
    return qtd_ptr->next_qtd_ptr;
}

static void usb_hal_ehci_set_alt_next_qtd_terminate_bit(uint32_t instance, ehci_qtd_struct_t* qtd_ptr)
{
  qtd_ptr->alt_next_qtd_ptr = EHCI_QTD_T_BIT;
}

static void usb_hal_ehci_link_qtd(uint32_t instance, ehci_qtd_struct_t* prev_qtd_ptr,uint32_t qtd_ptr)
{
   prev_qtd_ptr->next_qtd_ptr = qtd_ptr;
}



#elif (defined(CPU_VF65GS10_A5))
static void usb_hal_ehci_set_controller_host_mode(uint32_t instance)
{
	USB_MemMapPtr usb_reg_base_ptr;
	usb_reg_base_ptr = _usb_hal_ehci_get_base_addr(instance);
	usb_reg_base_ptr->USBMODE = (usb_reg_base_ptr->USBMODE & ~USB_USBMODE_CM_MASK) | USB_USBMODE_CM(0x3); 
}

static void usb_hal_ehci_set_controller_device_mode(uint32_t instance)
{
	USB_MemMapPtr usb_reg_base_ptr;
	usb_reg_base_ptr = _usb_hal_ehci_get_base_addr(instance);
	usb_reg_base_ptr->USBMODE = (usb_reg_base_ptr->USBMODE & ~USB_USBMODE_CM_MASK) | USB_USBMODE_CM(0x2); 
}

static void usb_hal_ehci_set_big_endian(uint32_t instance)
{
	USB_MemMapPtr usb_reg_base_ptr;
	usb_reg_base_ptr = _usb_hal_ehci_get_base_addr(instance);
	usb_reg_base_ptr->USBMODE = (usb_reg_base_ptr->USBMODE & ~USB_USBMODE_ES_MASK)|(1 << USB_USBMODE_ES_SHIFT);
}

static void usb_hal_ehci_set_little_endian(uint32_t instance)
{
	USB_MemMapPtr usb_reg_base_ptr;
	usb_reg_base_ptr = _usb_hal_ehci_get_base_addr(instance);
	usb_reg_base_ptr->USBMODE = (usb_reg_base_ptr->USBMODE & ~USB_USBMODE_ES_MASK)|(0 << USB_USBMODE_ES_SHIFT);
}

static void usb_hal_ehci_disable_setup_lock(uint32_t instance)
{
	USB_MemMapPtr usb_reg_base_ptr;
	usb_reg_base_ptr = _usb_hal_ehci_get_base_addr(instance);
	usb_reg_base_ptr->USBMODE = (usb_reg_base_ptr->USBMODE & ~USB_USBMODE_SLOM_MASK)|(1 << USB_USBMODE_SLOM_SHIFT);
}

static void usb_hal_ehci_enable_setup_lock(uint32_t instance)
{
	USB_MemMapPtr usb_reg_base_ptr;
	usb_reg_base_ptr = _usb_hal_ehci_get_base_addr(instance);
	usb_reg_base_ptr->USBMODE = (usb_reg_base_ptr->USBMODE & ~USB_USBMODE_SLOM_MASK)|(0 << USB_USBMODE_SLOM_SHIFT);
}

static uint32_t usb_hal_ehci_get_dcc_params(uint32_t instance)
{
	USB_MemMapPtr usb_reg_base_ptr;
	usb_reg_base_ptr = _usb_hal_ehci_get_base_addr(instance);
	return usb_reg_base_ptr->DCCPARAMS;
}

static void usb_hal_ehci_clear_ep_setup_status(uint32_t instance, uint32_t epSetupStatus)
{	
	USB_MemMapPtr usb_reg_base_ptr;
	usb_reg_base_ptr = _usb_hal_ehci_get_base_addr(instance);
	usb_reg_base_ptr->ENDPTSETUPSTAT |= (epSetupStatus << USB_ENDPTSETUPSTAT_ENDPTSETUPSTAT_SHIFT) & USB_ENDPTSETUPSTAT_ENDPTSETUPSTAT_MASK;
}

static uint32_t usb_hal_ehci_get_ep_setup_status(uint32_t instance)
{	
	USB_MemMapPtr usb_reg_base_ptr;
	usb_reg_base_ptr = _usb_hal_ehci_get_base_addr(instance);
	return usb_reg_base_ptr->ENDPTSETUPSTAT;
}

static uint32_t usb_hal_ehci_get_ep_complete_status(uint32_t instance)
{
	USB_MemMapPtr usb_reg_base_ptr;
	usb_reg_base_ptr = _usb_hal_ehci_get_base_addr(instance);
	return usb_reg_base_ptr->ENDPTCOMPLETE;
}

static void usb_hal_ehci_clear_ep_complete_status(uint32_t instance, uint32_t epCompleteStatus)
{
	USB_MemMapPtr usb_reg_base_ptr;
	usb_reg_base_ptr = _usb_hal_ehci_get_base_addr(instance);
	usb_reg_base_ptr->ENDPTCOMPLETE = epCompleteStatus;
}

static void usb_hal_ehci_set_eplist_address(uint32_t instance, uint32_t epQHAddress)
{
	USB_MemMapPtr usb_reg_base_ptr;
	usb_reg_base_ptr = _usb_hal_ehci_get_base_addr(instance);
	usb_reg_base_ptr->ENDPTLISTADDR = epQHAddress;
}

static uint32_t usb_hal_ehci_get_eplist_address(uint32_t instance)
{
	USB_MemMapPtr usb_reg_base_ptr;
	usb_reg_base_ptr = _usb_hal_ehci_get_base_addr(instance);
	return usb_reg_base_ptr->ENDPTLISTADDR;
}


static void usb_hal_ehci_enable_interrupts(uint32_t instance, uint32_t intrType)
{
	USB_MemMapPtr usb_reg_base_ptr;
	usb_reg_base_ptr = _usb_hal_ehci_get_base_addr(instance);
	usb_reg_base_ptr->USBINTR = intrType;
}

static void usb_hal_ehci_disable_interrupts(uint32_t instance, uint32_t intrType)
{
	USB_MemMapPtr usb_reg_base_ptr;
	usb_reg_base_ptr = _usb_hal_ehci_get_base_addr(instance);
	usb_reg_base_ptr->USBINTR &= ~intrType;
}
static void usb_hal_ehci_enable_pull_up(uint32_t instance)
{
	USB_MemMapPtr usb_reg_base_ptr;
	usb_reg_base_ptr = _usb_hal_ehci_get_base_addr(instance);
	usb_reg_base_ptr->USBCMD = EHCI_CMD_RUN_STOP;
}

static void usb_hal_ehci_initiate_attach_event(uint32_t instance)
{
	USB_MemMapPtr usb_reg_base_ptr;
	usb_reg_base_ptr = _usb_hal_ehci_get_base_addr(instance);
	usb_reg_base_ptr->USBCMD |= EHCI_CMD_RUN_STOP;
}

static void usb_hal_ehci_initiate_detach_event(uint32_t instance)
{
	USB_MemMapPtr usb_reg_base_ptr;
	usb_reg_base_ptr = _usb_hal_ehci_get_base_addr(instance);
	usb_reg_base_ptr->USBCMD &= ~EHCI_CMD_RUN_STOP;
}

static void usb_hal_ehci_reset_controller(uint32_t instance)
{
	USB_MemMapPtr usb_reg_base_ptr;
	usb_reg_base_ptr = _usb_hal_ehci_get_base_addr(instance);
	usb_reg_base_ptr->USBCMD = EHCI_CMD_CTRL_RESET;
}

static void usb_hal_ehci_set_dtd_tripwire(uint32_t instance)
{
	USB_MemMapPtr usb_reg_base_ptr;
	usb_reg_base_ptr = _usb_hal_ehci_get_base_addr(instance);
	usb_reg_base_ptr->USBCMD |= EHCI_CMD_ATDTW_TRIPWIRE_SET;
}

static void usb_hal_ehci_clear_dtd_tripwire(uint32_t instance)
{
	USB_MemMapPtr usb_reg_base_ptr;
	usb_reg_base_ptr = _usb_hal_ehci_get_base_addr(instance);
	usb_reg_base_ptr->USBCMD &= ~EHCI_CMD_ATDTW_TRIPWIRE_SET;
}
static uint32_t usb_hal_ehci_is_tripwire_set(uint32_t instance)
{
	USB_MemMapPtr usb_reg_base_ptr;
	usb_reg_base_ptr = _usb_hal_ehci_get_base_addr(instance);
	return (usb_reg_base_ptr->USBCMD & EHCI_CMD_ATDTW_TRIPWIRE_SET);
}

static void usb_hal_ehci_set_endpoint_prime(uint32_t instance, uint32_t value)
{	
	USB_MemMapPtr usb_reg_base_ptr;
	usb_reg_base_ptr = _usb_hal_ehci_get_base_addr(instance);
	usb_reg_base_ptr->ENDPTPRIME = value;
}

static uint32_t usb_hal_ehci_get_endpoint_prime(uint32_t instance)
{
	USB_MemMapPtr usb_reg_base_ptr;
	usb_reg_base_ptr = _usb_hal_ehci_get_base_addr(instance);
	return usb_reg_base_ptr->ENDPTPRIME;
}
static uint32_t usb_hal_echi_get_endpoint_status(uint32_t instance)
{
	USB_MemMapPtr usb_reg_base_ptr;
	usb_reg_base_ptr = _usb_hal_ehci_get_base_addr(instance);
	return usb_reg_base_ptr->ENDPTSTAT;
}

static void usb_hal_ehci_flush_endpoint_buffer(uint32_t instance, uint32_t epNumber)
{
	USB_MemMapPtr usb_reg_base_ptr;
	usb_reg_base_ptr = _usb_hal_ehci_get_base_addr(instance);
	usb_reg_base_ptr->ENDPTFLUSH = epNumber;
}

