jamesmunns/kinetis-rs/usb/usb_core/hal/fsl_usb_ehci_hal.h
static uint32_t usb_hal_ehci_is_endpoint_transfer_flushed(uint32_t instance, uint32_t epNumber)
{
	USB_MemMapPtr usb_reg_base_ptr;
	usb_reg_base_ptr = _usb_hal_ehci_get_base_addr(instance);
	return (usb_reg_base_ptr->ENDPTFLUSH & epNumber);
}

static uint32_t usb_hal_ehci_get_frame_index(uint32_t instance)
{
	USB_MemMapPtr usb_reg_base_ptr;
	usb_reg_base_ptr = _usb_hal_ehci_get_base_addr(instance);
	return usb_reg_base_ptr->FRINDEX;
}

static uint32_t usb_hal_ehci_get_port_status(uint32_t instance)
{
	USB_MemMapPtr usb_reg_base_ptr;
	usb_reg_base_ptr = _usb_hal_ehci_get_base_addr(instance);
	return usb_reg_base_ptr->PORTSC1;
}

static void usb_hal_ehci_set_port_status(uint32_t instance, uint32_t status)
{
	USB_MemMapPtr usb_reg_base_ptr;
	usb_reg_base_ptr = _usb_hal_ehci_get_base_addr(instance);
	usb_reg_base_ptr->PORTSC1 = status;
}

static uint32_t usb_hal_ehci_get_usb_status(uint32_t instance)
{
	USB_MemMapPtr usb_reg_base_ptr;
	usb_reg_base_ptr = _usb_hal_ehci_get_base_addr(instance);
	return usb_reg_base_ptr->USBSTS;
}

static void usb_hal_ehci_set_device_address(uint32_t instance, uint32_t address)
{
	USB_MemMapPtr usb_reg_base_ptr;
	usb_reg_base_ptr = _usb_hal_ehci_get_base_addr(instance);
	usb_reg_base_ptr->DEVICEADDR = (uint32_t)(address << USBHS_ADDRESS_BIT_SHIFT);
}

static void usb_hal_ehci_clear_device_address(uint32_t instance)
{
	USB_MemMapPtr usb_reg_base_ptr;
	usb_reg_base_ptr = _usb_hal_ehci_get_base_addr(instance);
	usb_reg_base_ptr->DEVICEADDR &= ~0xFE000000;
}

static void usb_hal_ehci_enable_endpoint(uint32_t instance, uint32_t epNumber, uint32_t direction, uint32_t type)
{
	USB_MemMapPtr usb_reg_base_ptr;
	usb_reg_base_ptr = _usb_hal_ehci_get_base_addr(instance);
	
	if (epNumber == 0)
		usb_reg_base_ptr->ENDPTCTRL0 |= ((direction ? (EHCI_EPCTRL_TX_ENABLE |
            EHCI_EPCTRL_TX_DATA_TOGGLE_RST) :
            (EHCI_EPCTRL_RX_ENABLE | EHCI_EPCTRL_RX_DATA_TOGGLE_RST)) |
            (type << (direction ?
            EHCI_EPCTRL_TX_EP_TYPE_SHIFT : EHCI_EPCTRL_RX_EP_TYPE_SHIFT)));
	else
		usb_reg_base_ptr->ENDPTCTRL[epNumber - 1] |= ((direction ? (EHCI_EPCTRL_TX_ENABLE |
            EHCI_EPCTRL_TX_DATA_TOGGLE_RST) :
            (EHCI_EPCTRL_RX_ENABLE | EHCI_EPCTRL_RX_DATA_TOGGLE_RST)) |
            (type << (direction ?
            EHCI_EPCTRL_TX_EP_TYPE_SHIFT : EHCI_EPCTRL_RX_EP_TYPE_SHIFT)));
}
static uint32_t usb_hal_ehci_get_endpoint_control(uint32_t instance, uint32_t epNumber)
{
	USB_MemMapPtr usb_reg_base_ptr;
	usb_reg_base_ptr = _usb_hal_ehci_get_base_addr(instance);
	return (epNumber == 0 ? usb_reg_base_ptr->ENDPTCTRL0 : usb_reg_base_ptr->ENDPTCTRL[epNumber - 1]);
}	


static void usb_hal_ehci_clear_endpoint_stall(uint32_t instance, uint32_t epNumber, uint32_t direction)
{
	USB_MemMapPtr usb_reg_base_ptr;
	usb_reg_base_ptr = _usb_hal_ehci_get_base_addr(instance);
	if (epNumber == 0)
		usb_reg_base_ptr->ENDPTCTRL0 &= ~(direction ? EHCI_EPCTRL_TX_EP_STALL : EHCI_EPCTRL_RX_EP_STALL);
	else
		usb_reg_base_ptr->ENDPTCTRL[epNumber - 1] &= ~(direction ? EHCI_EPCTRL_TX_EP_STALL : EHCI_EPCTRL_RX_EP_STALL);
}

static void usb_hal_ehci_stall_both_directions(uint32_t instance, uint32_t epNumber)
{
	USB_MemMapPtr usb_reg_base_ptr;
	usb_reg_base_ptr = _usb_hal_ehci_get_base_addr(instance);
	if (epNumber == 0)
		usb_reg_base_ptr->ENDPTCTRL0 |= (EHCI_EPCTRL_TX_EP_STALL | EHCI_EPCTRL_RX_EP_STALL);
	else
		usb_reg_base_ptr->ENDPTCTRL[epNumber - 1] |= (EHCI_EPCTRL_TX_EP_STALL | EHCI_EPCTRL_RX_EP_STALL);
}

static void usb_hal_ehci_stall_specific_direction(uint32_t instance, uint32_t epNumber, uint32_t direction)
{
	USB_MemMapPtr usb_reg_base_ptr;
	usb_reg_base_ptr = _usb_hal_ehci_get_base_addr(instance);
	if (epNumber == 0)
		usb_reg_base_ptr->ENDPTCTRL0 |= (direction ? EHCI_EPCTRL_TX_EP_STALL : EHCI_EPCTRL_RX_EP_STALL);
	else
		usb_reg_base_ptr->ENDPTCTRL[epNumber - 1] |= (direction ? EHCI_EPCTRL_TX_EP_STALL : EHCI_EPCTRL_RX_EP_STALL);
		
}

static void usb_hal_ehci_clear_max_packet_length(uint32_t instance,usb_ehc_dev_qh_struct_t * epQueueHeadAddr)
{
	epQueueHeadAddr->MAX_PKT_LENGTH = 0;
}

static void usb_hal_ehci_set_max_packet_length(uint32_t instance,usb_ehc_dev_qh_struct_t * epQueueHeadAddr, uint32_t maxPacketSize)
{
	epQueueHeadAddr->MAX_PKT_LENGTH = ((uint32_t)maxPacketSize << VUSB_EP_QUEUE_HEAD_MAX_PKT_LEN_POS);
}

static uint32_t usb_hal_ehci_is_ios_set(uint32_t instance, usb_ehc_dev_qh_struct_t * epQueueHeadAddr)
{
	return (epQueueHeadAddr->MAX_PKT_LENGTH & VUSB_EP_QUEUE_HEAD_IOS);
}



static void usb_hal_ehci_set_next_dtd_terminate(uint32_t instance,usb_ehc_dev_qh_struct_t * epQueueHeadAddr)
{
	epQueueHeadAddr->NEXT_DTD_PTR = VUSB_EP_QUEUE_HEAD_NEXT_TERMINATE;
}


static void usb_hal_ehci_set_qh_next_dtd(uint32_t instance,usb_ehc_dev_qh_struct_t * epQueueHeadAddr, uint32_t dtdAddr)
{
	epQueueHeadAddr->NEXT_DTD_PTR = dtdAddr;
}
static void usb_hal_ehci_set_next_dtd_invalid(uint32_t instance, usb_ehci_dev_dtd_struct_t * dtdAddr)
{
	dtdAddr->NEXT_TR_ELEM_PTR = USBHS_TD_NEXT_TERMINATE;
}

static void usb_hal_ehci_clear_size_ioc_sts(uint32_t instance, usb_ehci_dev_dtd_struct_t * dtdAddr)
{
	dtdAddr->SIZE_IOC_STS = 0;
}

static void usb_hal_ehci_clear_ioc_reserved_fields(uint32_t instance, usb_ehci_dev_dtd_struct_t * dtdAddr)
{
	dtdAddr->SIZE_IOC_STS &= ~USBHS_TD_RESERVED_FIELDS;
}

static void usb_hal_ehci_clear_dtd(uint32_t instance, usb_ehci_dev_dtd_struct_t * dtdAddr)
{
	dtdAddr->NEXT_TR_ELEM_PTR = 0;
	dtdAddr->SIZE_IOC_STS = 0;
	dtdAddr->BUFF_PTR0 = 0;
	dtdAddr->BUFF_PTR1 = 0;
	dtdAddr->BUFF_PTR2 = 0;
	dtdAddr->BUFF_PTR3 = 0;
	dtdAddr->BUFF_PTR4 = 0;
}

static void usb_hal_ehci_set_dtd_buffer_address(uint32_t instance, usb_ehci_dev_dtd_struct_t * dtdAddr, uint32_t addr)
{
	dtdAddr->BUFF_PTR0 = addr;
	dtdAddr->BUFF_PTR1 = addr + 4096;
	dtdAddr->BUFF_PTR2 = addr + (4096*2);
	dtdAddr->BUFF_PTR3 = addr + (4096*3);
	dtdAddr->BUFF_PTR4 = addr + (4096*4);
}

static void usb_hal_ehci_set_dtd_size_ioc_status(uint32_t instance, usb_ehci_dev_dtd_struct_t * dtdAddr, uint32_t value)
{
	dtdAddr->SIZE_IOC_STS = value;
}

static uint32_t usb_hal_ehci_get_dtd_size_ioc_status(uint32_t instance, usb_ehci_dev_dtd_struct_t * dtdAddr)
{
	return dtdAddr->SIZE_IOC_STS;
}


static uint32_t usb_hal_ehci_get_next_dtd_address(uint32_t instance, usb_ehci_dev_dtd_struct_t * dtdAddr)
{
	return (dtdAddr->NEXT_TR_ELEM_PTR & USBHS_TD_ADDR_MASK);
}

static uint32_t usb_hal_ehci_get_dtd_error_status(uint32_t instance, usb_ehci_dev_dtd_struct_t * dtdAddr)
{
	return (dtdAddr->SIZE_IOC_STS & USBHS_TD_ERROR_MASK);
}

static void usb_hal_ehci_clear_qh_error_status(uint32_t instance, usb_ehc_dev_qh_struct_t * epQueueHeadAddr, uint32_t errors)
{
	epQueueHeadAddr->SIZE_IOC_INT_STS &= ~errors;
}

static uint32_t usb_hal_ehci_get_tr_packet_size(uint32_t instance,usb_ehci_dev_dtd_struct_t * dtdAddr)
{
	return ((dtdAddr->SIZE_IOC_STS & VUSB_EP_TR_PACKET_SIZE) >> 16);
}

static uint32_t usb_hal_ehci_get_xd_for_this_dtd(uint32_t instance, usb_ehci_dev_dtd_struct_t * dtdAddr)
{
	return (uint32_t)dtdAddr->xd_for_this_dtd;
}

static void usb_hal_ehci_clear_size_ioc_int_sts(uint32_t instance, usb_ehc_dev_qh_struct_t * epQueueHeadAddr)
{
	epQueueHeadAddr->SIZE_IOC_INT_STS = 0;
}
#endif



#endif

#endif
